# FFPatByClass

## Description
Function FFPatByClass returns whether the global attributes are set to use the fill pattern of the default class.

```pascal
FUNCTION FFPatByClass : BOOLEAN;
```

```python

def vs.FFPatByClass():
    return BOOLEAN
```

## Remarks
Returns whether the global attributes are set to use the fill pattern of the default class.<BR>
<BR>
[sd 8/19/98]

## Examples
```pascal
useClassFPat:=FFPatByClass;
```

## Version
Availability: from VectorWorks8.0
## Category
* Document Attributes